// Создайте программу, которая вычислит выражение 20ˣ⅓+158² и выведет результат на экран.

package kostin.tema1;

public class Task1_1 {
	public static void main(String[] args) {
		System.out.println(20 * 1.0 / 3 + Math.pow(158, 2));
		for (int i =0;i<5;i+=2){
			System.out.println(i++);
		}
	}
}
