/* В переменной n хранится вещественное число с ненулевой дробной частью. 
 * Создайте программу, округляющую число n до ближайшего целого и выводящую 
 * результат на экран.
 */
package kostin.tema1;

public class Task1_4 {

	public static void main(String[] args) {
		double x = 56.28;
		System.out.println("x=" + Math.round(x));
	}

}
