/* В переменной n хранится двузначное число. 
 * Создайте программу, вычисляющую и выводящую 
 * на экран сумму цифр n.
 */
package kostin.tema1;

public class Task1_3 {

	public static void main(String[] args) {
		int n = 38;
		System.out.println(n / 10 + n % 10);
	}
}
