/* В переменной n лежит некоторое вещественное число. 
 * Вычислить и вывести на экран значение функции «сигнум» от этого числа 
 * (-1, если число отрицательное; 0, если нулевое; 1 если, положительное).
 */

package kostin.tema3;

public class Task3_4 {

	public static void main(String[] args) {
		double d = -4.456;
		System.out.println(Math.signum(d));

	}

}
