/* Создайте программу, которая будет генерировать и выводить на экран вещественное 
 * псевдослучайное число из промежутка [-3;3).
 */

package kostin.tema3;

public class Task3_2_1 {

	public static void main(String[] args) {
		System.out.println((Math.random() * 6) - 3);
	}

}
