/*В переменной n хранится натуральное двузначное число. 
 * Создайте программу, вычисляющую и выводящую на экран 
 * сумму цифр числа n.
 */
package kostin.tema2;

public class Task2_2 {

	public static void main(String[] args) {
		int n = 26;
		System.out.println("n=" + (n / 10 + n % 10));

	}

}
