/* В переменной n хранится вещественное число с ненулевой дробной частью. 
 * Создайте программу, округляющую число n до ближайшего целого и 
 * выводящую результат на экран.
 */
package kostin.tema2;

public class Task2_3 {

	public static void main(String[] args) {
		double x = 36.54;
		System.out.println("x=" + Math.round(x));
	}

}
